In [6]:
import pandas as pd
import numpy as np

# 1. 数据导入与导出

In [2]:
# CSV 数据导入
df = pd.read_csv('data/employees.csv')
df

,employee_id,first_name,last_name,email,phone_number,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,AD_PRES,24000.0,NaN,NaN,90.0
1,101,N_ann,Kochhar,NKOCHHAR,515.123.4568,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,IT_PROG,6000.0,NaN,103.0,60.0
...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,PFAY,603.123.6666,MK_REP,6000.0,NaN,201.0,20.0
103,203,Susan,Mavris,SMAVRIS,515.123.7777,HR_REP,6500.0,NaN,101.0,40.0
104,204,Hermann,Baer,HBAER,515.123.8888,PR_REP,10000.0,NaN,101.0,70.0
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,AC_MGR,12000.0,NaN,101.0,110.0
106,206,William,Gietz,WGIETZ,515.123.8181,AC_ACCOUNT,8300.0,NaN,205.0,110.0

In [3]:
# CSV 数据导出
df.tail().to_csv('data/employee_tail.csv')

In [4]:
# JSON 简单数据导入
df_json = pd.read_json('data/data1.json')
df_json

   id name  age
0   1   张三   25
1   2   李四   30
2   3   王五   28

In [5]:
# JSON 复杂数据导入（比如 test.json）
import json
with open('data/test.json',encoding='utf-8') as f:
    data = json.load(f)
print(data)
df_json2 = pd.DataFrame(data['users'])
df_json2

{'users': [{'id': 1, 'name': '张三', 'age': 28, 'email': 'zhangsan@example.com', 'is_active': True, 'join_date': '2022-03-15'}, {'id': 2, 'name': '李四', 'age': 35, 'email': 'lisi@example.com', 'is_active': False, 'join_date': '2021-11-02'}, {'id': 3, 'name': '王五', 'age': 24, 'email': 'wangwu@example.com', 'is_active': True, 'join_date': '2023-01-20'}]}

   id name  age                 email  is_active   join_date
0   1   张三   28  zhangsan@example.com       True  2022-03-15
1   2   李四   35      lisi@example.com      False  2021-11-02
2   3   王五   24    wangwu@example.com       True  2023-01-20

# 2. 处理缺失值

### 判断缺失值

In [19]:
# Series
Se = pd.Series([12,25,36,pd.NA,np.nan,None])
# DataFrame
Df = pd.DataFrame(
    {
        'Column1':[1,2,np.nan],
        'Column2':[3,pd.NA,None],
        'Column3':[4,2,5]
    }
)
# 判断是否为缺失值
Df.isna()
# 缺失值求和（添加 axis=0 / 1 更改求和方向）
Df.isna().sum()

Column1    1
Column2    2
Column3    0
dtype: int64

### 剔除缺失值

In [ ]:
## Series
Se.dropna()
## DataFrame
Df.dropna()  # dropna() 某一条存在一个缺失值，则删除这一整条
Df.dropna(how='all')  # 一整条都是缺失值，则删除
Df.dropna(thresh=3) # 至少有n个值不是缺失值，保留
Df.dropna(subset=['Column1']) # 指定列有缺失值，则删除有缺失值的那一行

   Column1 Column2  Column3
0      1.0       3        4
1      2.0    <NA>        2

### 填充缺失值

In [ ]:
weather = pd.read_csv('data/weather_withna.csv')
weather.fillna({'temp_max':20})  # 给 temp_max 该列的缺失值填上固定值
weather.fillna({'temp_max':weather['temp_max'].mean()}) # 缺失值填上该列的平均值（写法一）
weather.fillna(weather[['temp_max','wind']].mean()) # 缺失值填上该列的平均值（写法二）

weather.ffill() # 使用缺失值前一个有效值进行填充

            date  precipitation  temp_max  temp_min  wind  weather
0     2012-01-01            0.0      12.8       5.0   4.7  drizzle
1     2012-01-02           10.9      10.6       2.8   4.5     rain
2     2012-01-03            0.8      11.7       7.2   2.3     rain
3     2012-01-04           20.3      12.2       5.6   4.7     rain
4     2012-01-05            1.3       8.9       2.8   6.1     rain
...          ...            ...       ...       ...   ...      ...
1456  2015-12-27            0.0      11.1       4.4   4.8      sun
1457  2015-12-28            0.0      11.1       4.4   4.8      sun
1458  2015-12-29            0.0      11.1       4.4   4.8      sun
1459  2015-12-30            0.0      11.1       4.4   4.8      sun
1460  2015-12-31           20.6      12.2       5.0   3.8     rain

[1461 rows x 6 columns]